gfrans/Badge_2018/badge/hardware/samd/1.0.0/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache

badge_2018_nobl.name=Badge 2018 -- No Bootloader
badge_2018_nobl.vid.0=0x239A
badge_2018_nobl.pid.0=0x801E
badge_2018_nobl.vid.1=0x239A
badge_2018_nobl.pid.1=0x001E
badge_2018_nobl.upload.tool=bossac18
badge_2018_nobl.upload.protocol=sam-ba
badge_2018_nobl.upload.maximum_size=131072
badge_2018_nobl.upload.offset=0x2000
badge_2018_nobl.upload.use_1200bps_touch=true
badge_2018_nobl.upload.wait_for_upload_port=true
badge_2018_nobl.upload.native_usb=true
badge_2018_nobl.build.mcu=cortex-m0plus
badge_2018_nobl.build.f_cpu=48000000L
badge_2018_nobl.build.usb_product="Badge"
badge_2018_nobl.build.usb_manufacturer="Cisco"
badge_2018_nobl.build.board=BADGE_2018
badge_2018_nobl.build.core=badge_2018
badge_2018_nobl.build.extra_flags=-DCRYSTALLESS -DBADGE_2018 -D__SAMD21E17A__ -DARM_MATH_CM0PLUS {build.usb_flags}
badge_2018_nobl.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
badge_2018_nobl.build.openocdscript=openocd_scripts/arduino_zero.cfg
badge_2018_nobl.build.variant=badge_2018
badge_2018_nobl.build.variant_system_lib=
badge_2018_nobl.build.vid=0x239A
badge_2018_nobl.build.pid=0x801E
badge_2018_nobl.bootloader.tool=openocd
badge_2018_nobl.bootloader.file=badge_2018/bootloader_uf2.bin
